davidacat/aes67-esp32p4-module-dev-kit/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# L2 TAP for PTP
CONFIG_ESP_NETIF_L2_TAP=y

# PTP daemon: enable both client (slave) and server (grandmaster) roles
CONFIG_NETUTILS_PTPD=y
CONFIG_NETUTILS_PTPD_CLIENT=y
CONFIG_NETUTILS_PTPD_SERVER=y

# PTP server settings tuned for AES67 interoperability
CONFIG_NETUTILS_PTPD_SYNC_INTERVAL_MSEC=125
CONFIG_NETUTILS_PTPD_ANNOUNCE_INTERVAL_MSEC=2000
CONFIG_NETUTILS_PTPD_PRIORITY1=128
CONFIG_NETUTILS_PTPD_PRIORITY2=128
CONFIG_NETUTILS_PTPD_CLASS=248
CONFIG_NETUTILS_PTPD_ACCURACY=254
CONFIG_NETUTILS_PTPD_CLOCKSOURCE=160
CONFIG_NETUTILS_PTPD_TWOSTEP_SYNC=y
CONFIG_NETUTILS_PTPD_SEND_DELAYREQ=y
CONFIG_NETUTILS_PTPD_DELAYREQ_AVGCOUNT=8
# Max path delay: 1ms is generous for switched LAN (typical 100-500us)
CONFIG_NETUTILS_PTPD_MAX_PATH_DELAY_NS=1000000
# Path delay stability threshold for sending delay requests
CONFIG_NETUTILS_PTPD_PATH_DELAY_STABILITY_NS=5000

# PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# lwIP - tuned for low-latency AES67/PTP
CONFIG_LWIP_IGMP=y
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_NETBUF_RECVINFO=y
CONFIG_LWIP_IP_DEFAULT_TTL=64

# Larger UDP receive buffer for RTP/PTP packet bursts
CONFIG_LWIP_UDP_RECVMBOX_SIZE=32

# Larger TCP/IP task stack and higher priority
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=4096
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU1=y

# Disable nagle, we want low latency not throughput
CONFIG_LWIP_TCP_NAGLE_DEFAULT=n

# Ethernet driver tuning
CONFIG_ETH_DMA_RX_BUFFER_NUM=16
CONFIG_ETH_DMA_TX_BUFFER_NUM=16

# mDNS
CONFIG_MDNS_MAX_SERVICES=8

# FreeRTOS - 10kHz tick for sub-ms audio/PTP timing resolution
CONFIG_FREERTOS_HZ=10000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# System
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Flash
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
